{
  "categories": [
    "All",
    "Design",
    "Technology",
    "Culture",
    "Architecture",
    "Sustainability"
  ],
  "featuredPost": {
    "id": 0,
    "title": "The Renaissance of Analog: Why Print Matters in a Digital Age",
    "excerpt": "As digital saturation reaches its peak, designers, artists, and readers alike are rediscovering the tactile permanence, authenticity, and sensory depth of paper. From handcrafted books to independent magazines, print is asserting its value not just as a medium, but as a cultural statement that contrasts the fleeting nature of digital content. This exploration delves into how the new wave of independent publishing is redefining storytelling, engaging communities, and influencing modern design aesthetics in ways screens never can.",
    "author": "Elena Rossi",
    "date": "Oct 24, 2025",
    "readTime": "8 min read",
    "category": "Culture",
    "image": "https://images.unsplash.com/photo-1507842217121-9e93a586b7b0?q=80&w=2071&auto=format&fit=crop",
    "accent": "bg-orange-500"
  },
  "posts": [
    {
      "id": 1,
      "title": "Swiss Grid Systems: A Practical Guide for Web",
      "excerpt": "The Swiss grid system, pioneered by Josef Müller-Brockmann, is celebrated for its rigorous mathematical structure, visual balance, and modular precision. Translating these principles to modern responsive web design involves not only maintaining order and clarity, but also creating layouts that adapt fluidly across devices without losing harmony. This guide examines practical techniques to integrate grids into UI design, typography, and layout workflows, ensuring consistency while embracing the flexibility demanded by contemporary digital platforms.",
      "date": "Nov 02, 2025",
      "readTime": "5 min read",
      "category": "Design",
      "author": "Lukas Meier",
      "image": "https://images.unsplash.com/photo-1558655146-d09347e92766?q=80&w=2000&auto=format&fit=crop"
    },
    {
      "id": 2,
      "title": "Sustainable Architecture in the Alps",
      "excerpt": "Nestled in the heart of Zurich, a new library exemplifies cutting-edge sustainable architecture. By utilizing 100% recycled concrete, integrating passive heating and cooling systems, and leveraging solar energy, the project minimizes environmental impact while maximizing occupant comfort. This article explores the design philosophy, material choices, and technological innovations that enable large-scale buildings to reduce carbon footprints, demonstrating how architecture can harmonize functionality, aesthetics, and ecological responsibility in mountainous environments.",
      "date": "Oct 28, 2025",
      "readTime": "6 min read",
      "category": "Architecture",
      "image": "https://images.unsplash.com/photo-1511818966892-d7d671e672a2?q=80&w=2071&auto=format&fit=crop"
    },
    {
      "id": 3,
      "title": "The Future of Interface Typography",
      "excerpt": "Typography on digital interfaces is evolving rapidly, with variable fonts and dynamic text technologies transforming how users experience content. Designers now have the ability to manipulate weight, width, and style in real time, improving legibility and readability across devices while adding expressive nuance to the interface. This piece examines the impact of these innovations on accessibility, branding, and interactive experiences, and discusses best practices for integrating typography that adapts seamlessly to diverse screen sizes and user needs.",
      "date": "Oct 15, 2025",
      "readTime": "4 min read",
      "category": "Technology",
      "image": "https://images.unsplash.com/photo-1618005182384-a83a8bd57fbe?q=80&w=1964&auto=format&fit=crop"
    },
    {
      "id": 4,
      "title": "Minimalism is Not Just White Space",
      "excerpt": "Minimal design is often misunderstood as simply creating empty or sparse layouts, but true minimalism is about the deliberate selection and placement of every element. It prioritizes hierarchy, clarity, and purposeful interactions to enhance usability and focus. This article explores examples from product design, web interfaces, and branding to illustrate how minimalism can communicate sophistication and intention, proving that less is not merely emptiness, but a strategy to amplify meaning and guide user attention.",
      "date": "Oct 10, 2025",
      "readTime": "5 min read",
      "category": "Design",
      "image": "https://images.unsplash.com/photo-1494438639946-1ebd1d20bf85?q=80&w=2000&auto=format&fit=crop"
    },
    {
      "id": 5,
      "title": "AI Systems May Need Global Ethical Watch",
      "excerpt": "As artificial intelligence permeates every sector, concerns about bias, fairness, and transparency are escalating. Regulatory bodies across the EU are advocating for comprehensive monitoring frameworks to ensure AI systems make ethical decisions, particularly in high-stakes areas such as finance, healthcare, and criminal justice. This article examines the proposals for unified AI oversight, explores case studies of bias in automated systems, and discusses how international collaboration could provide safeguards while fostering innovation in AI development.",
      "date": "Nov 20, 2025",
      "readTime": "7 min read",
      "category": "Technology",
      "image": "https://images.unsplash.com/photo-1555949963-aa79dcee981c?q=80&w=2000&auto=format&fit=crop"
    },
    {
      "id": 6,
      "title": "UN Announces Climate Materials Treaty",
      "excerpt": "The United Nations has unveiled an ambitious Climate Materials Treaty, targeting a 35% reduction in material-related emissions for architectural and construction projects worldwide by 2030. This landmark agreement encourages the adoption of low-carbon materials, circular construction practices, and innovative design solutions. The article explores the potential implications for architects, builders, and urban planners, highlighting how regulatory pressure, technological advances, and international cooperation are poised to redefine sustainable development standards on a global scale.",
      "date": "Nov 18, 2025",
      "readTime": "6 min read",
      "category": "Sustainability",
      "image": "https://images.unsplash.com/photo-1482192596544-9eb780fc7f66?q=80&w=2000&auto=format&fit=crop"
    },
    {
      "id": 7,
      "title": "Historic Italian Museum Goes Digital",
      "excerpt": "In a bold fusion of heritage and technology, a prominent Roman museum has launched a fully interactive virtual experience, allowing users worldwide to explore its exhibits. Developed in collaboration with university students, the project leverages 3D modeling, immersive storytelling, and interactive navigation tools. This article examines how digitization preserves cultural artifacts, expands public access, and provides a platform for innovative educational programs, demonstrating that even centuries-old institutions can embrace the digital age without sacrificing authenticity.",
      "date": "Nov 16, 2025",
      "readTime": "5 min read",
      "category": "Culture",
      "image": "https://images.unsplash.com/photo-1580136579312-94651ffb89c7?q=80&w=2000&auto=format&fit=crop"
    }
  ],
  "trending": [
    { "id": 1, "title": "Typography trends for 2026" },
    { "id": 2, "title": "Interview: Dieter Rams" },
    { "id": 3, "title": "Brutalism in UI: Still relevant?" },
    { "id": 4, "title": "Color palettes from the 60s" },
    { "id": 5, "title": "EU advances AI safety bill" }
  ]
}
